; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v2 - type_3 ?v6 - type_1)
 	      (pred_4 ?v1 - object ?v6 - type_1)
	      (pred_3 ?v2 - type_3 ?v3 - type_2)
	      (pred_1 ?v2 - type_3 ?v1 - object ?v3 - type_2))

   (:action op_1
       :parameters  (?v2 - type_3 ?v5 ?v7 - type_1)
       :precondition (and  (pred_2 ?v2 ?v5))
       :effect (and  (pred_2 ?v2 ?v7)
		     (not (pred_2 ?v2 ?v5))))

   (:action op_2
       :parameters (?v2 - type_3 ?v4 - object ?v8 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_4 ?v4 ?v8) (pred_2 ?v2 ?v8) (pred_3 ?v2 ?v3))
       :effect (and (pred_1 ?v2 ?v4 ?v3)
		    (not (pred_4 ?v4 ?v8)) 
		    (not (pred_3 ?v2 ?v3))))

   (:action op_3
       :parameters (?v2 - type_3 ?v4 - object ?v8 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_1 ?v2 ?v4 ?v3) (pred_2 ?v2 ?v8))
       :effect (and (pred_4 ?v4 ?v8)
		    (pred_3 ?v2 ?v3)
		    (not (pred_1 ?v2 ?v4 ?v3)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_10 obj_03 - type_3
obj_06 obj_01 obj_09 obj_08 - type_2
obj_07 obj_04 obj_11 obj_02 - type_1
obj_13 obj_12 obj_05 - object)
(:init
(pred_2 obj_10 obj_07)
(pred_3 obj_10 obj_06)
(pred_3 obj_10 obj_01)
(pred_2 obj_03 obj_11)
(pred_3 obj_03 obj_09)
(pred_3 obj_03 obj_08)
(pred_4 obj_13 obj_02)
(pred_4 obj_12 obj_04)
(pred_4 obj_05 obj_07)
)
(:goal
(and
(pred_4 obj_13 obj_02)
(pred_4 obj_12 obj_02)
(pred_4 obj_05 obj_02)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_10 obj_02) (pred_2 obj_03 obj_02))))
  )
)
)

; plan
1. (op_2 obj_10 obj_05 obj_07 obj_01)
   deleted: (pred_4 obj_05 obj_07) (pred_3 obj_10 obj_01)
   added: (pred_1 obj_10 obj_05 obj_01)
   goals met: 1 of 3
2. (op_1 obj_03 obj_11 obj_07)
   deleted: (pred_2 obj_03 obj_11)
   added: (pred_2 obj_03 obj_07)
   goals met: 1 of 3
3. (op_1 obj_10 obj_07 obj_04)
   deleted: (pred_2 obj_10 obj_07)
   added: (pred_2 obj_10 obj_04)
   goals met: 1 of 3
4. (op_2 obj_10 obj_12 obj_04 obj_06)
   deleted: (pred_4 obj_12 obj_04) (pred_3 obj_10 obj_06)
   added: (pred_1 obj_10 obj_12 obj_06)
   goals met: 1 of 3
5. (op_1 obj_10 obj_04 obj_02)
   deleted: (pred_2 obj_10 obj_04)
   added: (pred_2 obj_10 obj_02)
   goals met: 1 of 3
6. (op_3 obj_10 obj_05 obj_02 obj_01)
   deleted: (pred_1 obj_10 obj_05 obj_01)
   added: (pred_4 obj_05 obj_02) (pred_3 obj_10 obj_01)
   goals met: 2 of 3
7. (op_3 obj_10 obj_12 obj_02 obj_06)
   deleted: (pred_1 obj_10 obj_12 obj_06)
   added: (pred_4 obj_12 obj_02) (pred_3 obj_10 obj_06)
   goals met: 3 of 3
